Revit 2024 API
BuiltInFailures.ElectricalFailures.MaximumNumberOfPolesExceeded Property
 You cannot add more poles to this spare, as doing so would exceed the maximum number of poles set for this equipment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MaximumNumberOfPolesExceeded { get; }
Visual Basic
Public Shared ReadOnly Property MaximumNumberOfPolesExceeded As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MaximumNumberOfPolesExceeded {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace